title: Detects Suspicious edit of .bash_profile and .bashrc on Linux systems
status: experimental
description: Detects change of user environment. Adversaries can insert code into these files to gain persistence each time a user logs in or opens a new shell.
references:
    - 'MITRE Attack technique T1156; .bash_profile and .bashrc '
date: 2019/05/12
tags:
    - attack.s0002
    - attack.t1156
    - attack.persistence
author: Peter Matkovski
logsource:
    product: linux
    service: auditd
detection:
    cmds:
        - type: 'PATH'
          name: '/home/*/.bashrc'
        - type: 'PATH'
          name: '/home/*/.bash_profile'
        - type: 'PATH'
          name: '/home/*/.profile'
        - type: 'PATH'
          name: '/etc/profile.d/*'
        - type: 'PATH'
          name: '/etc/profile'
        - type: 'PATH'
          name: '/etc/shells'
        - type: 'PATH'
          name: '/etc/bashrc'
        - type: 'PATH'
          name: '/etc/csh.cshrc'
        - type: 'PATH'
          name: '/etc/csh.login'
    condition: 1 of cmds
falsepositives:
    - Admin or User activity
level: medium
